{
  "hello": "Γειά σου!",
  "welcome": "Καλώς ήρθατε",
  "about": "Σχετικά",
  "services": "Υπηρεσίες",
  "contact": "Επικοινωνία",
  "explore": "Εξερεύνηση",
  "learnMore": "Μάθετε περισσότερα",
  "home": "Αρχική",
  "menu": "Μενού",
  "search": "Αναζήτηση",
  "settings": "Ρυθμίσεις",
  "profile": "Προφίλ",
  "signIn": "Σύνδεση",
  "signOut": "Αποσύνδεση",
  "submit": "Υποβολή",
  "cancel": "Ακύρωση",
  "back": "Πίσω",
  "next": "Επόμενο",
  "error": "Σφάλμα",
  "warning": "Προειδοποίηση",
  "success": "Επιτυχία",
  "loading": "Φόρτωση",
  "username": "Όνομα χρήστη",
  "password": "Κωδικός πρόσβασης",
  "confirmPassword": "Επιβεβαίωση κωδικού",
  "email": "Email",
  "phone": "Τηλέφωνο",
  "address": "Διεύθυνση",
  "city": "Πόλη",
  "country": "Χώρα",
  "zipcode": "Ταχυδρομικός κώδικας",
  "language": "Γλώσσα",
  "save": "Αποθήκευση",
  "edit": "Επεξεργασία",
  "delete": "Διαγραφή",
  "confirmation": "Επιβεβαίωση",
  "areYouSure": "Είστε σίγουροι;",
  "yes": "Ναι",
  "no": "Όχι",
  "projects": "Έργα",
  "name": "Όνομα",
  "message": "Μήνυμα",
  "privacyPolicy": "Πολιτική Απορρήτου",
  "mySkills": "Οι Δεξιότητές μου",
  "mySkillsDescription": "Έχω εμπειρία σε μια ευρεία γκάμα γλωσσών προγραμματισμού, πλαισίων και τεχνολογιών. Πάντα ανυπόμονος να μάθω περισσότερα και να επεκτείνω τις γνώσεις μου.",
  "intro": "Γεια, Ονομάζομαι Aran Jannson. Είμαι φοιτητής δεύτερου έτους στην Πληροφορική στο Πανεπιστήμιο του Surrey.",
  "welcomePortfolio": "Καλωσορίσατε στον ιστότοπο του χαρτοφυλακίου μου! Εδώ, μπορείτε να εξερευνήσετε τα πιο δημοφιλή έργα μου στο GitHub, να βρείτε τρόπους να επικοινωνήσετε μαζί μου, και να ανακαλύψετε περισσότερα για εμένα.",
  "pages": "Σελίδες",
  "importantInformation": "Σημαντικές Πληροφορίες",
  "externalLinks": "Εξωτερικοί Σύνδεσμοι",
  "iconsFrom": "Εικονίδια Από",
  "poweredBy": "Υποστηρίζεται Από",
  "copyright": "Πνευματικά Δικαιώματα © ",
  "copyrightEnd": "Aran Jannson - Όλα τα Δικαιώματα Επιφυλακτούνται.",
  "myMostPopularProjects": "Τα Πιο Δημοφιλή Έργα μου",
  "helloMyNameIs": "Γεια, Ονομάζομαι",
  "undergradDescription": "Είμαι φοιτητής δεύτερου έτους στην Πληροφορική στο",
  "universityOfSurrey": "Πανεπιστήμιο του Surrey",
  "findMeAt": "Βρείτε με στο",
  "socials": "Κοινωνικά Δίκτυα",
  "nameIsRequired": "Το όνομα απαιτείται",
  "emailIsRequired": "Το email απαιτείται",
  "messageIsRequired": "Το μήνυμα απαιτείται",
  "githubLink": "Σύνδεσμος GitHub",
  "previous": "Προηγούμενος",

  "projectDjangoCom2025": {
    "title": "Εργασία Μαθήματος Ανάπτυξης Εφαρμογών Web",
    "description": "Αυτό το έργο Django για την ενότητα COM2025 είναι ένας ιστότοπος σχεδιασμένος για μια πλατφόρμα διανομής μουσικής."
  },
  "projectComputerSecurityA_1": {
    "title": "Εργασία Μαθήματος Κυβερνοασφάλειας 1",
    "description": "Αυτή η εργασία για την ενότητα COM2041 επικεντρώνεται κυρίως στις πρακτικές εφαρμογές της κρυπτογραφίας, συμπεριλαμβανομένων των προηγμένων προτύπων κρυπτογράφησης όπως το AES, των προτύπων κρυπτογράφησης δεδομένων όπως το DES, των αλγορίθμων ασφαλούς κατακερματισμού όπως το SHA, και των συστημάτων κρυπτογραφίας δημοσίου κλειδιού όπως το RSA."
  },
  "projectComputerSecurityA_2": {
    "title": "Εργασία Μαθήματος Κυβερνοασφάλειας 2",
    "description": "Αυτή η δεύτερη εργασία για την ενότητα COM2041 επικεντρώνεται κυρίως στα πρωτόκολλα ασφαλείας, συμπεριλαμβανομένης της αξιολόγησης των ευπαθειών σε επιθέσεις man-in-the-middle από πιθανούς επιτιθέμενους, όπως ο Alice και ο Bob. Αυτό περιλαμβάνει μεθόδους για κατακερματισμό, κρυπτογράφηση, και την εφαρμογή διευθύνσεων MAC (Message Authentication Code) για την προστασία δεδομένων κατά τη μετάδοση μεταξύ χρηστών που χρησιμοποιούν το λογισμικό Scyther."
  },
  "projectOperatingSystemsCOM1032": {
    "title": "Εργασία Λειτουργικών Συστημάτων",
    "description": "Αυτό το Java project για το μάθημα COM1032 προσομοιώνει πώς ανατίθεται και αποδεσμεύεται η μνήμη στα υπολογιστικά συστήματα."
  },
  "projectSoftwareEngineeringCOM1028": {
    "title": "Εργασία Μηχανικής Λογισμικού",
    "description": "Σε αυτό το Java-based project για το μάθημα COM1028, χρησιμοποιείται Java για πρόσβαση και ερωτήματα σε μια βάση δεδομένων SQLite."
  },
  "projectComputerLogicCOM1031": {
    "title": "Εργασία Υπολογιστικής Λογικής",
    "description": "Αυτό το project σε γλώσσα ARM-32bit Assembly για το μάθημα COM1031 είναι ένας μεταφραστής κώδικα Morse. Εμφανίζει το γράμμα που εισάγεται σε μια οθόνη 7 τμημάτων και στο τερματικό, χρησιμοποιώντας ένα κουμπί για την εισαγωγή."
  },
  "projectWebDatabaseCOM1025": {
    "title": "Εργασία Web και Συστημάτων Βάσεων Δεδομένων",
    "description": "Σχεδιασμένο για το μάθημα COM1025, αυτό το web project διαθέτει ένα απλό backend βάσης δεδομένων, που προσπελάστηκε μέσω PHP."
  },
  "projectJavaForBeginners": {
    "title": "Java για Αρχάριους",
    "description": "Μια λίστα με εργασίες σε Java για να μάθετε τις βασικές έννοιες."
  },
  "projectSurreyCompSocWebapp": {
    "title": "Web Εφαρμογή Surrey CompSoc",
    "description": "Ως ο Web Master για την Κοινωνία Υπολογιστών του Πανεπιστημίου του Surrey, έχω αναλάβει τη δημιουργία μιας νέας web εφαρμογής για την κοινωνία."
  },
  "projectPortfolioWebsite": {
    "title": "Ιστοσελίδα Πορτφόλιο",
    "description": "Το αποθετήριο στο github για αυτήν την ιστοσελίδα."
  },
  "projectElectronPenNT": {
    "title": "PenNT",
    "description": "Καταγράψτε, οργανώστε και αποκτήστε πρόσβαση στις σκέψεις σας χωρίς κόπο με μια απλή, ισχυρή εφαρμογή σημειώσεων που προσφέρει διαισθητικό σχεδιασμό και υποστήριξη πολυμέσων, εξασφαλίζοντας ότι οι ιδέες σας συγχρονίζονται σε όλες τις συσκευές."
  },


  "privacyPolicyDesc": {
    "title": "Πολιτική Απορρήτου",
    "subtitle": "Καλώς Ήρθατε στο Χαρτοφυλάκιο του Aran Jannson",
    "paragraph1": "Σας ευχαριστούμε που επισκεφθήκατε το χαρτοφυλάκιο του Aran Jannson. Αυτή η Πολιτική Απορρήτου περιγράφει πώς χειριζόμαστε τις πληροφορίες που συλλέγουμε από τους επισκέπτες μας. Ο ιστότοπός μας έχει σχεδιαστεί για να παρουσιάσει το χαρτοφυλάκιο μας και περιλαμβάνει συνδέσμους προς εξωτερικούς ιστοτόπους για περαιτέρω πληροφορίες.",
    "useOfCookies": "Χρήση Cookies",
    "paragraph2": "1. Τι είναι τα Cookies; Τα Cookies είναι μικρά αρχεία κειμένου που τοποθετούνται στη συσκευή σας για να συλλέγουν πληροφορίες καταγραφής διαδικτύου και συμπεριφοράς των επισκεπτών. Μας βοηθούν να βελτιώσουμε τον ιστότοπό μας και να προσφέρουμε καλύτερη και πιο προσωποποιημένη υπηρεσία.",
    "paragraph3": "2. Πώς Χρησιμοποιούμε τα Cookies: Χρησιμοποιούμε τα cookies για να κατανοήσουμε πώς αλληλεπιδράτε με τον ιστότοπό μας, κάτι που μας βοηθά να ενισχύσουμε την εμπειρία χρήστη. Τα cookies μπορεί να παρακολουθούν πράγματα όπως πόσο χρόνο περνάτε στον ιστότοπο και τις σελίδες που επισκέπτεστε.",
    "paragraph4": "3. Η Επιλογή σας Αναφορικά με τα Cookies: Μπορείτε να επιλέξετε να αποδεχτείτε ή να απορρίψετε τα cookies. Οι περισσότεροι διαδικτυακοί περιηγητές αποδέχονται αυτόματα τα cookies, αλλά μπορείτε να τροποποιήσετε τις ρυθμίσεις του περιηγητή σας για να απορρίψετε τα cookies εάν το προτιμάτε. Σημειώστε ότι η απενεργοποίηση των cookies μπορεί να περιορίσει την εμπειρία σας στον ιστότοπό μας.",
    "externalLinks": "Εξωτερικοί Σύνδεσμοι",
    "paragraph5": "Ο ιστότοπός μας περιέχει συνδέσμους προς εξωτερικούς ιστοτόπους. Παρακαλούμε να είστε ενήμεροι ότι δεν ελέγχουμε αυτούς τους ιστοτόπους, και αυτή η Πολιτική Απορρήτου δεν ισχύει για αυτούς. Σας ενθαρρύνουμε να διαβάσετε τις δηλώσεις απορρήτου κάθε άλλου ιστοτόπου που συλλέγει προσωπικά αναγνωρίσιμες πληροφορίες.",
    "noPersonalInformationCollected": "Δεν Συλλέγονται Προσωπικά Στοιχεία",
    "paragraph6": "Δεν συλλέγουμε προσωπικά στοιχεία από τους επισκέπτες μας. Ο ιστότοπός μας είναι καθαρά πληροφοριακός, και δεν απαιτείται εγγραφή ή υποβολή προσωπικών δεδομένων.",
    "security": "Ασφάλεια",
    "paragraph7": "Δεσμευόμαστε να διασφαλίσουμε ότι οι πληροφορίες σας είναι ασφαλείς. Ενώ δεν συλλέγουμε προσωπικά στοιχεία, λαμβάνουμε προφυλάξεις για να εξασφαλίσουμε τον ιστότοπό μας και να τον προστατεύσουμε από μη εξουσιοδοτημένη πρόσβαση.",
    "policyUpdates": "Ενημερώσεις Πολιτικής",
    "paragraph8": "Μπορεί να ενημερώνουμε περιστασιακά αυτήν την Πολιτική Απορρήτου. Προτρέπουμε τους επισκέπτες να ελέγχουν συχνά αυτήν τη σελίδα για οποιεσδήποτε αλλαγές και να παραμένουν ενημερωμένοι σχετικά με το πώς βοηθάμε στην προστασία των προσωπικών στοιχείων που συλλέγουμε.",
    "contactUs": "Επικοινωνία μαζί μας",
    "paragraph9": "Εάν έχετε οποιαδήποτε ερωτήσεις σχετικά με αυτήν την Πολιτική Απορρήτου, παρακαλούμε μη διστάσετε να επικοινωνήσετε μαζί μας μέσω https://www.aranjannson.com/contact."
  },

  "homePageDescription": "Καλώς ήρθατε στο Χαρτοφυλάκιο του Aran Jannson: Βυθιστείτε σε μια επιλεγμένη συλλογή από τα πιο επιδραστικά μου έργα, περιηγηθείτε στην εμπειρία μου σε διάφορες γλώσσες προγραμματισμού και πλαίσια, και μάθετε περισσότερα για μένα. Συνδεθείτε μαζί μου μέσω συνδέσμων στο GitHub και LinkedIn για μια βαθύτερη εικόνα του επαγγελματικού μου ταξιδιού.",
  "contactPageDescription": "Θέλετε να επικοινωνήσετε; Επισκεφθείτε τη σελίδα Επικοινωνίας στον ιστότοπο Χαρτοφυλακίου μου. Εδώ μπορείτε να με προσεγγίσετε, είτε για επαγγελματικές συνεργασίες, είτε για ερωτήματα σχετικά με έργα, ή ακόμα και απλά για να πείτε ένα γεια. Είμαι πάντα ανοιχτός σε νέες ευκαιρίες και συνομιλίες!",
  "privacyPolicyPageDescription": "Διαβάστε τη δέσμευσή μου για την ιδιωτικότητά σας στον Ιστότοπο. Αυτή η Πολιτική Απορρήτου περιγράφει πώς χειρίζομαι και προστατεύω τις πληροφορίες σας, διασφαλίζοντας διαφάνεια και εμπιστοσύνη στις ψηφιακές μου αλληλεπιδράσεις.",
  "projectsPageDescription": "Εξερευνήστε μια σειρά από τα καινοτόμα έργα μου που παρουσιάζουν την εμπειρία μου σε διάφορες τεχνολογίες και δημιουργικές λύσεις. Αυτή η σελίδα τονίζει το επαγγελματικό μου ταξίδι στην ανάπτυξη λογισμικού και σχεδίαση, αντανακλώντας το πάθος μου για συνεργασία και τεχνική αριστεία.",
  "socialsPageDescription": "Ανακαλύψτε την παρουσία μου στα social media στη σελίδα Socials του χαρτοφυλακίου μου. Εδώ θα βρείτε απευθείας συνδέσμους για να συνδεθείτε με εμένα στο LinkedIn, GitHub, GitLab και άλλα. Ακολουθήστε για τις τελευταίες ενημερώσεις, επαγγελματικές προσεγγίσεις και διαδραστικές αλληλεπιδράσεις σε διάφορες πλατφόρμες.",
  "blogPageDescription": "Καλώς ήρθατε στο Blog μου! Βυθιστείτε σε έναν κόσμο σκέψεων, διορατικότητας και ιστοριών στον Ιστότοπο Χαρτοφυλακίου μου. Εδώ μοιράζομαι τις εμπειρίες, τις γνώσεις και τις ιδέες μου σχετικά με την τεχνολογία, τα έργα και την επαγγελματική ανάπτυξη. Γίνετε μέρος της συζήτησης και εξερευνήστε τις τελευταίες δημοσιεύσεις μου.",

  "homeThumbnail" : "/thumbnails/home_el.jpg",
  "projectsThumbnail" : "/thumbnails/projects_el.jpg",
  "contactThumbnail" : "/thumbnails/contact_el.jpg",
  "privacyPolicyThumbnail" : "/thumbnails/privacyPolicy_el.jpg",
  "socialsThumbnail" : "/thumbnails/socials_el.jpg",

  "computerSociety" : "Η Κοινωνία Υπολογιστών του Πανεπιστημίου του Surrey",

  "aboutInfo":{
    "intro": "Γειά σας! Ονομάζομαι Αράν Τζάνσον και βρίσκομαι στο δεύτερο έτος των σπουδών μου στην Πληροφορική στο Πανεπιστήμιο του Surrey. Είμαι Βρετανός Τουρκοκύπριος, έχοντας περάσει το μεγαλύτερο μέρος της ζωής μου στην Κύπρο πριν μετακομίσω στο Ηνωμένο Βασίλειο το 2022.",
    "language_proficiency": "Μιλώ άπταιστα και τα δύο, Αγγλικά και Τουρκικά, και αυτή τη στιγμή μαθαίνω βασικά Ελληνικά.",
    "academic_interest": "Οι ακαδημαϊκές και επαγγελματικές μου πάθη εστιάζονται κυρίως στους τομείς της ανάπτυξης ιστοσελίδων και εφαρμογών. Επιπλέον, έχω μια αυξανόμενη ενδιαφέρον στους τομείς της τεχνητής νοημοσύνης, τομέας τον οποίο βρίσκω προκλητικό και συναρπαστικό.",
    "hobbies": "Τα χόμπι μου περιλαμβάνουν ανάπτυξη ιστοσελίδων, ανάπτυξη εφαρμογών και καρτινγκ. Αυτή τη στιγμή δουλεύω πάνω σε αρκετά έργα, και μπορείτε να τα βρείτε στον ιστότοπό μου. Ακολουθεί ο σύνδεσμος για τη σελίδα των έργων μου ",
    "committee_role": "Είμαι επίσης ενεργό μέλος της επιτροπής της Κοινωνίας Υπολογιστών του Πανεπιστημίου του Surrey. Για να μάθετε περισσότερα για την κοινωνία μας και τις δραστηριότητές μας, επισκεφθείτε την ιστοσελίδα μας μέσω αυτού του συνδέσμου: ",
    "lab_helper_experience": "Το 2023, ενίσχυσα περαιτέρω τις δεξιότητές μου και συνέβαλα στην πανεπιστημιακή κοινότητα, εργαζόμενος ως βοηθός εργαστηρίου για το μάθημα των Συστημάτων Ιστού και Βάσεων Δεδομένων στο Πανεπιστήμιο του Surrey. Αυτός ο ρόλος μου επέτρεψε να αλληλεπιδράσω απευθείας με τους φοιτητές, βοηθώντας τους να κατανοήσουν περίπλοκες έννοιες ιστοσελίδων και βάσεων δεδομένων.",
    "contact_instruction_part1": "Εάν θέλετε να επικοινωνήσετε μαζί μου, μπορείτε να το κάνετε επισκεπτόμενοι την",
    "contact_instruction_part2": " τη σελίδα"
  }

}