{
  "hello": "Hello!",
  "welcome": "Welcome",
  "about": "About",
  "services": "Services",
  "contact": "Contact",
  "explore": "Explore",
  "learnMore": "Learn More",
  "home": "Home",
  "menu": "Menu",
  "search": "Search",
  "settings": "Settings",
  "profile": "Profile",
  "signIn": "Sign In",
  "signOut": "Sign Out",
  "submit": "Submit",
  "cancel": "Cancel",
  "back": "Back",
  "next": "Next",
  "error": "Error",
  "warning": "Warning",
  "success": "Success",
  "loading": "Loading",
  "username": "Username",
  "password": "Password",
  "confirmPassword": "Confirm Password",
  "email": "Email",
  "phone": "Phone",
  "address": "Address",
  "city": "City",
  "country": "Country",
  "zipcode": "Zip Code",
  "language": "Language",
  "save": "Save",
  "edit": "Edit",
  "delete": "Delete",
  "confirmation": "Confirmation",
  "areYouSure": "Are you sure?",
  "yes": "Yes",
  "no": "No",
  "projects": "Projects",
  "name": "Name",
  "message": "Message",
  "privacyPolicy": "Privacy Policy",
  "mySkills": "My Skills",
  "mySkillsDescription": "I have experience in a wide range of programming languages, frameworks, and technologies. Always eager to learn more and expand my skillset.",
  "welcomePortfolio": "Welcome to my portfolio website! Here, you can explore my most popular GitHub projects, find ways to reach me, and discover more details about myself.",
  "pages": "Pages",
  "importantInformation": "Important Information",
  "externalLinks": "External Links",
  "iconsFrom": "Icons From",
  "poweredBy": "Powered by",
  "copyright": "Copyright © ",
  "copyrightEnd": "Aran Jannson - All Rights Reserved.",
  "myMostPopularProjects": "My Most Popular Projects",
  "helloMyNameIs": "Hello, My Name Is",
  "undergradDescription": "I am a second-year undergraduate student studying Computer Science at",
  "universityOfSurrey": "The University of Surrey",
  "findMeAt": "Find Me At",
  "socials": "Socials",
  "nameIsRequired": "Name is required",
  "emailIsRequired": "Email is required",
  "messageIsRequired": "Message is required",
  "githubLink": "GitHub Link",
  "previous": "Previous",


  "projectDjangoCom2025": {
    "title": " Web Applications Development Coursework",
    "description": "This Django project for the COM2025 module is a website designed for a music distribution platform."
  },
  "projectComputerSecurityA_1": {
    "title": "Computer Security Coursework 1",
    "description": "This coursework for the COM2041 module is concentrated primarily on the practical applications of cryptography, including advanced encryption standards like AES, data encryption standards like DES, secure hashing algorithms like SHA, and public-key cryptographic systems like RSA."
  },
  "projectComputerSecurityA_2": {
    "title": "Computer Security Coursework 2",
    "description": "This second coursework for the COM2041 module is focused primarily on security protocols, including the assessment of vulnerabilities to man-in-the-middle attacks by potential attackers, such as Alice and Bob. It encompasses methods for hashing, encryption, and the application of MAC (Message Authentication Code) addresses to safeguard data during transmission between users utilizing the Scyther software."
  },
  "projectOperatingSystemsCOM1032": {
    "title": "Operating Systems Coursework",
    "description": "This Java project for the COM1032 module simulates how memory is allocated and deallocated in computer systems."
  },
  "projectSoftwareEngineeringCOM1028": {
    "title": "Software Engineering Coursework",
    "description": "In this Java-based project for the COM1028 module, Java is utilized to access and query a SQLite database."
  },
  "projectComputerLogicCOM1031": {
    "title": "Computer Logic Coursework",
    "description": "This ARM-32bit Assembly language project for the COM1031 module is a Morse code translator. It displays the inputted letter on a 7-segment display and in the terminal, using a button for input."
  },
  "projectWebDatabaseCOM1025": {
    "title": "Web and Database Systems Coursework",
    "description": "Designed for the COM1025 module, this web project features a simple database backend, accessed through PHP."
  },
  "projectJavaForBeginners": {
    "title": "Java For Beginners",
    "description": "A list of tasks in Java to learn the core concepts."
  },
  "projectSurreyCompSocWebapp": {
    "title": "Surrey CompSoc Web Application",
    "description": "As the Web Master for the University Of Surrey Computing Society, I have been tasked with creating a new web application for the society."
  },
  "projectPortfolioWebsite": {
    "title": "Portfolio Website",
    "description": "The github repository for this website."
  },
  "projectElectronPenNT": {
    "title": "PenNT",
    "description": "Capture, organize, and access your thoughts effortlessly with a simple, powerful note-taking application that offers intuitive design and multimedia support, ensuring your ideas are synchronized across devices."
  },


  "privacyPolicyDesc": {
    "title": "Privacy Policy",
    "subtitle": "Welcome to Aran Jannson's Portfolio Website!",
    "paragraph1": "Thank you for visiting Aran Jannson's Portfolio Website. This Privacy Policy outlines how we handle information collected from our visitors. Our website is designed to showcase our portfolio and includes links to external websites for further information.",
    "useOfCookies": "Use of Cookies",
    "paragraph2": "1. What are Cookies? Cookies are small text files placed on your device to collect standard internet log information and visitor behavior. They help us improve our site and provide a better, more personalized service.",
    "paragraph3": "2. How We Use Cookies: We use cookies to understand how you interact with our site, which helps us enhance your user experience. Cookies may track things like how long you spend on the site and the pages you visit.",
    "paragraph4": "3. Your Choice Regarding Cookies: You can choose to accept or decline cookies. Most web browsers automatically accept cookies, but you can modify your browser setting to decline cookies if you prefer. Note that disabling cookies may limit your experience on our website.",
    "externalLinks": "External Links",
    "paragraph5": "Our website contains links to external sites. Please be aware that we do not control these other websites, and this Privacy Policy does not apply to them. We encourage you to read the privacy statements of any other site that collects personally identifiable information.",
    "noPersonalInformationCollected": "No Personal Information Collected",
    "paragraph6": "We do not collect personal information from our visitors. Our website is purely informational, and no registration or personal data submission is required.",
    "security": "Security",
    "paragraph7": "We are committed to ensuring that your information is secure. While we do not collect personal information, we take precautions to secure our website and protect it from unauthorized access.",
    "policyUpdates": "Policy Updates",
    "paragraph8": "We may update this Privacy Policy occasionally. We encourage visitors to frequently check this page for any changes and to stay informed about how we are helping to protect the personal information we collect.",
    "contactUs": "Contact Us",
    "paragraph9": "If you have any questions about this Privacy Policy, please do not hesitate to contact us through https://www.aranjannson.com/contact ."
  },

  "homePageDescription": "Welcome to Aran Jannson's Portfolio: Dive into a curated selection of my most impactful projects, browse my expertise in various programming languages and frameworks, and get to know more about me. Connect with me through links to my GitHub and LinkedIn for a deeper insight into my professional journey.",
  "contactPageDescription": "Looking to connect? Visit the Contact page on my Portfolio Website. Here, you can reach out to me, whether for professional collaborations, project inquiries, or just to say hello. I'm always open to new opportunities and conversations!",
  "privacyPolicyPageDescription": "Read my commitment to your privacy on the Website. This Privacy Policy outlines how I handle and protect your information, ensuring transparency and trust in my digital interactions.",
  "projectsPageDescription": "Explore a range of my innovative projects showcasing expertise in various technologies and creative solutions. This page highlights my professional journey in software development and design, reflecting my passion for collaboration and technical excellence.",
  "socialsPageDescription": "Discover my social media presence on the Socials page of my portfolio. Here, you'll find direct links to connect with me on LinkedIn, GitHub, GitLab, and more. Follow along for my latest updates, professional insights, and interactive engagements across various platforms.",
  "blogPageDescription": "Welcome to my Blog! Dive into a world of thoughts, insights, and stories on my Portfolio Website. Here, I share my experiences, knowledge, and ideas on technology, projects, and professional growth. Join the conversation and explore my latest posts.",

  "homeThumbnail" : "/thumbnails/home.jpg",
  "projectsThumbnail" : "/thumbnails/projects.jpg",
  "contactThumbnail" : "/thumbnails/contact.jpg",
  "privacyPolicyThumbnail" : "/thumbnails/privacyPolicy.jpg",
  "socialsThumbnail" : "/thumbnails/socials.jpg",

  "computerSociety" : "The Univeristy Of Surrey Computing Society",

  "aboutInfo":{
    "intro": "Hello! My name is Aran Jannson, and I'm currently in my second year studying Computer Science at the University of Surrey. I am a British Turkish Cypriot, having spent the majority of my life in Cyprus before relocating to the UK in 2022.",
    "language_proficiency": "I am fluent in both English and Turkish, I am also currently learning basic Greek.",
    "academic_interest": "My academic and professional passions lie primarily in the realms of web and app development. Additionally, I have a growing interest in the fields of artificial intelligence, which I find both challenging and exciting.",
    "hobbies": "My hobbies include web development, app development, and karting. I am currently working on several projects, and you can find them on my website. Here's the link to my projects page",
    "committee_role": "I am also an active committee member of the University of Surrey Computing Society. To learn more about our society and our activities, visit our website via this link: ",
    "lab_helper_experience": "In 2023, I further enhanced my skills and contributed to the university community by being a lab helper for the Web and Database Systems module at the University of Surrey. This role enabled me to engage directly with students, aiding their understanding of complex web and database concepts.",
    "contact_instruction_part1": "If you would like to contact me, you can do so by visiting my",
    "contact_instruction_part2": " page"

  }

}