{
  "hello": "Merhaba!",
  "welcome": "Hoş geldiniz",
  "about": "Hakkında",
  "services": "Hizmetler",
  "contact": "İletişim",
  "explore": "Keşfet",
  "learnMore": "Daha fazla öğren",
  "home": "Ana Sayfa",
  "menu": "Menü",
  "search": "Ara",
  "settings": "Ayarlar",
  "profile": "Profil",
  "signIn": "Giriş yap",
  "signOut": "Çıkış yap",
  "submit": "Gönder",
  "cancel": "İptal",
  "back": "Geri",
  "next": "İleri",
  "error": "Hata",
  "warning": "Uyarı",
  "success": "Başarılı",
  "loading": "Yükleniyor",
  "username": "Kullanıcı adı",
  "password": "Şifre",
  "confirmPassword": "Şifreyi Onayla",
  "email": "E-posta",
  "phone": "Telefon",
  "address": "Adres",
  "city": "Şehir",
  "country": "Ülke",
  "zipcode": "Posta Kodu",
  "language": "Dil",
  "save": "Kaydet",
  "edit": "Düzenle",
  "delete": "Sil",
  "confirmation": "Onay",
  "areYouSure": "Emin misiniz?",
  "yes": "Evet",
  "no": "Hayır",
  "projects": "Projeler",
  "name": "İsim",
  "message": "Mesaj",
  "privacyPolicy": "Gizlilik Politikası",
  "mySkills": "Becerilerim",
  "mySkillsDescription": "Birçok programlama dili, çerçeve ve teknolojide deneyime sahibim. Daha fazlasını öğrenmeye ve beceri setimi genişletmeye her zaman hevesliyim.",
  "intro": "Merhaba, Benim Adım Aran Jannson. Surrey Üniversitesi'nde Bilgisayar Bilimi üzerine ikinci yıl lisans öğrencisiyim.",
  "welcomePortfolio": "Portföy web siteme hoş geldiniz! Burada, en popüler GitHub projelerimi keşfedebilir, bana ulaşmanın yollarını bulabilir ve kendimle ilgili daha fazla detay öğrenebilirsiniz.",
  "pages": "Sayfalar",
  "importantInformation": "Önemli Bilgiler",
  "externalLinks": "Harici Bağlantılar",
  "iconsFrom": "İkonlar Tarafından",
  "poweredBy": "Tarafından Desteklenmektedir",
  "copyright": "Telif Hakkı © ",
  "copyrightEnd": "Aran Jannson - Tüm Hakları Saklıdır.",
  "myMostPopularProjects": "En Popüler Projelerim",
  "helloMyNameIs": "Merhaba, Benim Adım",
  "undergradDescription": "Bilgisayar Bilimi üzerine ikinci yıl lisans öğrencisiyim,",
  "universityOfSurrey": "Surrey Üniversitesi'nde",
  "findMeAt": "Beni şurada bulun",
  "socials": "Sosyal Medya",
  "nameIsRequired": "İsim gerekli",
  "emailIsRequired": "E-posta gerekli",
  "messageIsRequired": "Mesaj gerekli",
  "githubLink": "GitHub Bağlantısı",
  "previous": "Önceki",
  "projectJavaForBeginnersDescription": "Java'da temel kavramları öğrenmek için bir görev listesi",
  "projectSurreyCompSocWebappDescription": "Surrey Üniversitesi Bilişim Topluluğu'nun Web Ustası olarak, topluluk için yeni bir web uygulaması oluşturma görevi aldım.",
  "projectPortfolioWebsiteDescription": "Bu web sitesi için GitHub deposu",
  "projectJavaForBeginnersName": "Başlangıç Seviyesi İçin Java",
  "projectSurreyCompSocWebappName": "Surrey CompSoc Web Uygulaması",
  "projectPortfolioWebsiteName": "Portföy Web Sitesi",

  "privacyPolicyDesc": {
    "title": "Gizlilik Politikası",
    "subtitle": "Aran Jannson'un Portföy Web Sitesine Hoş Geldiniz!",
    "paragraph1": "Aran Jannson'un Portföy Web Sitesi'ni ziyaret ettiğiniz için teşekkür ederiz. Bu Gizlilik Politikası, ziyaretçilerimizden topladığımız bilgilerin nasıl ele alındığını açıklamaktadır. Web sitemiz, Aran Jannson'un portföyünü sergilemek için tasarlanmıştır ve daha fazla bilgi için dış web sitelerine bağlantılar içermektedir.",
    "useOfCookies": "Çerezlerin Kullanımı",
    "paragraph2": "1. Çerezler Nedir? Çerezler, standart internet günlük bilgilerini ve ziyaretçi davranışlarını toplamak için cihazınıza yerleştirilen küçük metin dosyalarıdır. Sitemizi iyileştirmemize ve daha iyi, daha kişiselleştirilmiş bir hizmet sunmamıza yardımcı olurlar.",
    "paragraph3": "2. Çerezleri Nasıl Kullanıyoruz: Sitemizle nasıl etkileşimde bulunduğunuzu anlamak için çerezleri kullanıyoruz, bu da kullanıcı deneyiminizi geliştirmemize yardımcı olur. Çerezler, sitede ne kadar zaman geçirdiğiniz ve ziyaret ettiğiniz sayfalar gibi şeyleri takip edebilir.",
    "paragraph4": "3. Çerezler Konusunda Tercihiniz: Çerezleri kabul etmeyi ya da reddetmeyi seçebilirsiniz. Çoğu web tarayıcısı otomatik olarak çerezleri kabul eder, ancak tercih ederseniz tarayıcı ayarlarınızı çerezleri reddedecek şekilde değiştirebilirsiniz. Unutmayın ki, çerezleri devre dışı bırakmak web sitemizdeki deneyiminizi sınırlayabilir.",
    "externalLinks": "Dış Bağlantılar",
    "paragraph5": "Web sitemiz, dış sitelere bağlantılar içermektedir. Lütfen bu diğer web sitelerini kontrol etmediğimizi ve bu Gizlilik Politikasının onlara uygulanmadığını unutmayın. Kişisel olarak tanımlanabilir bilgi toplayan herhangi bir başka siteye ait gizlilik beyanlarını okumanızı teşvik ederiz.",
    "noPersonalInformationCollected": "Kişisel Bilgi Toplanmamaktadır",
    "paragraph6": "Ziyaretçilerimizden kişisel bilgi toplamıyoruz. Web sitemiz tamamen bilgilendirici olup, kayıt ya da kişisel veri gönderimi gerektirmez.",
    "security": "Güvenlik",
    "paragraph7": "Bilgilerinizin güvenliğini sağlamaya kararlıyız. Kişisel bilgi toplamasak da, web sitemizi yetkisiz erişimden korumak ve güvence altına almak için önlemler alıyoruz.",
    "policyUpdates": "Politika Güncellemeleri",
    "paragraph8": "Bu Gizlilik Politikasını ara sıra güncelleyebiliriz. Ziyaretçilerimizi, herhangi bir değişiklik için bu sayfayı sık sık kontrol etmeye ve topladığımız kişisel bilgileri nasıl koruduğumuz konusunda bilgilendirilmeleri için teşvik ederiz.",
    "contactUs": "Bizimle İletişime Geçin",
    "paragraph9": "Bu Gizlilik Politikası hakkında herhangi bir sorunuz varsa, lütfen https://www.aranjannson.com/contact aracılığıyla bizimle iletişime geçmekten çekinmeyin."
  },

  "homePageDescription": "Aran Jannson'un Portföyüne Hoş Geldiniz: En etkili projelerimin özenle seçilmiş bir koleksiyonuna dalın, çeşitli programlama dillerindeki ve çerçevelerdeki uzmanlığımı keşfedin ve benim hakkımda daha fazla bilgi edinin. Profesyonel yolculuğuma daha derin bir bakış için GitHub ve LinkedIn linklerimle bağlantı kurun.",
  "contactPageDescription": "Bağlantı kurmak ister misiniz? Portföy Web Sitemdeki İletişim sayfasını ziyaret edin. İster profesyonel işbirlikleri, proje sorguları veya sadece merhaba demek için olsun, ben her zaman yeni fırsatlar ve sohbetler için açığım!",
  "privacyPolicyPageDescription": "Web Sitemde gizliliğinize olan bağlılığımı okuyun. Bu Gizlilik Politikası, bilgilerinizi nasıl ele aldığımı ve koruduğumu açıklar, dijital etkileşimlerimde şeffaflık ve güven sağlar.",
  "projectsPageDescription": "Çeşitli teknolojilerdeki ve yaratıcı çözümlerdeki uzmanlığımı sergileyen yenilikçi projelerim arasında gezinin. Bu sayfa, yazılım geliştirme ve tasarımdaki profesyonel yolculuğumu vurgular, işbirliği tutkumu ve teknik mükemmelliği yansıtır.",
  "socialsPageDescription": "Portföyümdeki Sosyal Medya sayfasında sosyal medya varlığımı keşfedin. Burada, LinkedIn, GitHub, GitLab ve daha fazlasında benimle bağlantı kurmak için doğrudan linkler bulacaksınız. En son güncellemelerim, profesyonel içgörülerim ve çeşitli platformlarda etkileşimli katılımlarım için beni takip edin.",
  "blogPageDescription": "Bloguma Hoş Geldiniz! Portföy Web Sitemde teknoloji, projeler ve profesyonel büyüme hakkında düşünceler, içgörüler ve hikayeler dünyasına dalın. Deneyimlerimi, bilgimi ve fikirlerimi paylaşıyorum. Sohbete katılın ve en son gönderilerimi keşfedin.",

  "homeThumbnail" : "/thumbnails/home_tr.jpg",
  "projectsThumbnail" : "/thumbnails/projects_tr.jpg",
  "contactThumbnail" : "/thumbnails/contact_tr.jpg",
  "privacyPolicyThumbnail" : "/thumbnails/privacyPolicy_tr.jpg",
  "socialsThumbnail" : "/thumbnails/socials_tr.jpg",

  "computerSociety" : "Surrey Üniversitesi Bilgisayar Topluluğu",

  "aboutInfo":{
    "intro": "Merhaba! Benim adım Aran Jannson ve şu anda Surrey Üniversitesi'nde Bilgisayar Bilimi üzerine ikinci yılımdayım. Bir İngiliz Kıbrıslı Türk'üyüm, hayatımın çoğunu Kıbrıs'ta geçirdikten sonra 2022 yılında İngiltere'ye taşındım.",
    "language_proficiency": "İngilizce ve Türkçe'yi akıcı bir şekilde konuşuyorum, ayrıca şu anda temel Yunanca öğreniyorum.",
    "academic_interest": "Akademik ve profesyonel tutkularım esas olarak web ve uygulama geliştirmede yatmaktadır. Ayrıca, hem zorlayıcı hem de heyecan verici bulduğum yapay zeka alanlarına artan bir ilgi duyuyorum.",
    "hobbies": "Web geliştirme, uygulama geliştirme ve karting benim hobilerim arasında yer alıyor. Şu anda birkaç projede çalışıyorum ve bunları web sitemde bulabilirsiniz. İşte projelerim sayfasının bağlantısı ",
    "committee_role": "Surrey Üniversitesi Bilgisayar Topluluğu'nun da aktif bir komite üyesiyim. Topluluğumuz ve etkinliklerimiz hakkında daha fazla bilgi almak için bu bağlantı aracılığıyla web sitemizi ziyaret edin: ",
    "lab_helper_experience": "2023 yılında, Surrey Üniversitesi'nde Web ve Veritabanı Sistemleri modülünde laboratuvar yardımcısı olarak becerilerimi daha da geliştirdim ve üniversite topluluğuna katkıda bulundum. Bu rol, öğrencilerle doğrudan etkileşimde bulunmama ve web ve veritabanı kavramlarını anlamalarına yardımcı olmama olanak tanıdı.",
    "contact_instruction_part1": "Eğer benimle iletişime geçmek isterseniz, bunu yapmak için benim",
    "contact_instruction_part2": " sayfamı ziyaret edin"

  }

}